//Даны два числа. Показать большее и меньшее число

int x = 9;
int y = 5;

if (x > y)
{
    Console.Write ("Большее число ");
    Console.WriteLine(x);
    Console.Write ("Меньшее число ");
    Console.WriteLine(y);
}
else 
{
    Console.Write ("Большее число ");
    Console.WriteLine(y);
    Console.Write ("Меньшее число ");
    Console.WriteLine(x);
}