//Написать программу вычисления значения функции y = f(a) (Sin(a + Cos(1/a))

int a;
double y;

Console.Write("x = ");
x = Convert.ToInt32(Console.ReadLine());

y = Sin(a + Cos(1/a));

Console.Write("y = ");
Console.WriteLine(y);